АлогистикТест2/src/Documents/алк_ЗагрузкаВКамеру/алк_ЗагрузкаВКамеру.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ЗагрузкаВКамеру</name>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыНаСкладахСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПакетыВСушильныхКамерах</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЛесопродукции</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СушильнаяКамера</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаПолучатель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Техкарта</name>
    <type>
      <types>CatalogRef.алк_ТехкартаСушки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапуска</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОстанова</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦелеваяВлажность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяВлажностьСредняя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечнаяВлажностьСредняя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечнаяВлажностьФактСредняя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Режим</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимКомментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СобственнымиСилами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продан</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НачальнаяВлажность</name>
    <attributes>
      <name>Влажность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонечнаяВлажность</name>
    <attributes>
      <name>Влажность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонечнаяВлажностьФакт</name>
    <attributes>
      <name>Влажность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Catalogs/алк_ЗагрузкаВКамеруПрисоединенныеФайлы/алк_ЗагрузкаВКамеруПрисоединенныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>алк_ЗагрузкаВКамеруПрисоединенныеФайлы</name>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef.алк_ЗагрузкаВКамеру</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеФайла</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Catalog>

АлогистикТест2/src/Documents/алк_ЗагрузкаВКамеру/Forms/ФормаПрисоединенияФайла/Module.bsl
//////КОМАНДЫ /////////////////////////
&НаКлиенте
Процедура ОК(Команда) 
	Если НЕ ЗначениеЗаполнено(АдресФайла) Тогда //когда открепили файл от документа
	УдалениеДанныхПоФайлуВСправочнике(СсылкаНаСтрочкуОФайлеВСправочнике,Неопределено);	
	ИначеЕсли ПрикрепилиФайлКДокументу Тогда //когда прикрепили новый файл, либо поменяли 
		ДобавлениеИзменениеДанныхПоФайлуВСправочнике(СсылкаНаСтрочкуОФайлеВСправочнике,ИмяФайла,АдресФайла,Документ); //открепили файл от документа 
	КонецЕсли;         
	Если НЕ ПрикрепилиФайлКДокументу И ЗначениеЗаполнено(АдресФайла) Тогда 
		Сообщение = Неопределено; 
	ИначеЕсли НЕ ПрикрепилиФайлКДокументу Тогда 
		Сообщение = "Файл успешно откреплен!"
	Иначе
		Сообщение = "Файл успешно прикреплен!"
	КонецЕсли;	
	Закрыть(Сообщение); 
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОткрепитьФайл(Команда) 
	ПоказатьВопрос(Новый ОписаниеОповещения("ПередУдалениемФайла",ЭтаФорма),"Внимание! Файл будет безвозвратно удален. Продолжить?",РежимДиалогаВопрос.ОКОтмена);
КонецПроцедуры  

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	Если НЕ ЗначениеЗаполнено(АдресФайла) Тогда 
		Сообщить("Ошибка! Файл не обнаружен.Прикрепите сначала файл к документу.");
		Возврат;
	КонецЕсли;
	ПолучитьФайл(АдресФайла,ИмяФайла);
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФайл(Команда) 
	Если ЗначениеЗаполнено(АдресФайла) Тогда    
		ПоказатьВопрос(Новый ОписаниеОповещения("ПовторноеПрикреплениеФайла",ЭтаФорма),"Прикрепить файл повторно?",РежимДиалогаВопрос.ОКОтмена);
		Возврат;
	КонецЕсли;
	ПрикрепитьФайлНаКлиенте();
КонецПроцедуры 
//////////////////////////////////////////


&НаСервереБезКонтекста
Процедура ДобавлениеИзменениеДанныхПоФайлуВСправочнике(СсылкаНаСтрочкуВСправочникеПрисоедФайлов,ИмяФайла,АдресВрХранилища,Док) 
	СтруктураДанныхПоФайлу = Новый Структура("ДатаДобавления,Документ,ДанныеФайла,Наименование,Автор",ТекущаяДата(),Док,
	Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресВрХранилища)),ИмяФайла,Пользователи.ТекущийПользователь());
	//если изменили существующий файл,перезаполянем
	Если ЗначениеЗаполнено(СсылкаНаСтрочкуВСправочникеПрисоедФайлов) Тогда 
		Данные = СсылкаНаСтрочкуВСправочникеПрисоедФайлов.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(Данные,СтруктураДанныхПоФайлу); 
		Данные.Записать(); 
	Иначе //создаем  
		НСтрока = Справочники.алк_ЗагрузкаВКамеруПрисоединенныеФайлы.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(НСтрока,СтруктураДанныхПоФайлу);
		НСтрока.Записать();
	КонецЕсли; 
КонецПроцедуры      

&НаСервереБезКонтекста
Процедура УдалениеДанныхПоФайлуВСправочнике(СсылкаНаСтрочкуВСправочникеПрисоедФайлов,Док) 
	Данные = СсылкаНаСтрочкуВСправочникеПрисоедФайлов.ПолучитьОбъект(); 
	Данные.Удалить();
КонецПроцедуры

&НаКлиенте
Процедура ПередУдалениемФайла(Результат,ДопПараметры) Экспорт   
	Если Результат = КодВозвратаДиалога.Отмена ИЛИ Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли; 
	АдресФайла = ""; 
	ИмяФайла = "";
	ПрикрепилиФайлКДокументу = Ложь;	
КонецПроцедуры

&НаКлиенте
Процедура ПовторноеПрикреплениеФайла(Результат,ДопПараметры) Экспорт  
	Если Результат = КодВозвратаДиалога.Отмена Тогда 
		Возврат;
	КонецЕсли;
	ПрикрепитьФайлНаКлиенте();
КонецПроцедуры 

&НаКлиенте
Процедура ПрикрепитьФайлНаКлиенте()
НачатьПомещениеФайлаНаСервер(Новый ОписаниеОповещения("ОбработатьВыборФайла",ЭтаФорма));		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Документ = Параметры.Док; 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	алк_ЗагрузкаВКамеруПрисоединенныеФайлы.Ссылка,
	               |	алк_ЗагрузкаВКамеруПрисоединенныеФайлы.Наименование
	               |ИЗ
	               |	Справочник.алк_ЗагрузкаВКамеруПрисоединенныеФайлы КАК алк_ЗагрузкаВКамеруПрисоединенныеФайлы
	               |ГДЕ
	               |	алк_ЗагрузкаВКамеруПрисоединенныеФайлы.Документ = &Документ";
	Запрос.УстановитьПараметр("Документ",Документ);
    Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл   
		СсылкаНаСтрочкуОФайлеВСправочнике = Выборка.Ссылка; 
		АдресФайла = ПолучитьНавигационнуюСсылку(Выборка.Ссылка,"ДанныеФайла");	
		ИмяФайла = Выборка.Наименование;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборФайла(Результат,ДопПараметры) Экспорт 
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли; 
	Формат = НРег(Результат.СсылкаНаФайл.Файл.Расширение);
	Если Формат = ".pdf" ИЛИ Формат = ".jpg" ИЛИ 
		Формат = ".jpeg" Тогда //прошел проверку
	Иначе
		Сообщить("Разрешено прикреплять файлы только в формате: pdf, jpg, jpeg!");
		Возврат;
	КонецЕсли;
	Если Результат.СсылкаНаФайл.Файл.Размер() > 10485760 Тогда  
		Сообщить("Отказ в прикрепление файла! Файл размером более 10 МБ.");  
		Возврат;
	КонецЕсли;
	АдресФайла = Результат.Адрес;             
	ИмяФайла = Результат.СсылкаНаФайл.Имя;
	ПрикрепилиФайлКДокументу = Истина;
КонецПроцедуры
